20240207T201038--kdoc-79-localeの標準的な紙のサイズとは__code.org
:properties:
:ID: 20240207T201038
:end:
#+title:      KDOC 79: Localeの標準的な紙のサイズとは
#+date:       [2024-02-07 Wed 20:10]
#+filetags: :code:
#+identifier: 20240207T201038

* この文書のステータス
:LOGBOOK:
CLOCK: [2024-02-07 Wed 21:47]--[2024-02-07 Wed 22:12] =>  0:25
:END:
- 作成
  - [X] 2024-02-07 貴島
- レビュー
  - [X] 2024-02-08 貴島
* 概要
Localeで紙のサイズの項目がある。謎に細かいけど、紙のサイズも国や地域によって異なる単位なことを初めて認識した。
* 値を調べる
#+caption: 現在のlocale表示。LC_PAPERがある
#+begin_src shell
  locale
#+end_src

#+RESULTS:
#+begin_src
LANG=en_US.UTF-8
LANGUAGE=en_US
LC_CTYPE="en_US.UTF-8"
LC_NUMERIC=ja_JP.UTF-8
LC_TIME="en_US.UTF-8"
LC_COLLATE="en_US.UTF-8"
LC_MONETARY=ja_JP.UTF-8
LC_MESSAGES="en_US.UTF-8"
LC_PAPER=ja_JP.UTF-8
LC_NAME=ja_JP.UTF-8
LC_ADDRESS=ja_JP.UTF-8
LC_TELEPHONE=ja_JP.UTF-8
LC_MEASUREMENT=ja_JP.UTF-8
LC_IDENTIFICATION=ja_JP.UTF-8
LC_ALL=
#+end_src

セットされている値を調べる。

#+caption: 値を調べる
#+begin_src shell
locale -k LC_PAPER
#+end_src

#+RESULTS:
#+begin_src
height=297
width=210
paper-codeset="UTF-8"
#+end_src

210mm x 297mm はA4であるので、日本の標準的な紙サイズはA4になっていることになる。そういう感じはする。
* 関連
- [[https://www.school.ctc-g.co.jp/columns/miyazaki/miyazaki11.html][コラム - WSLで始めるUbuntu | 第11回　ロケールとプロンプト変数について知ろう｜CTC教育サービス 研修/トレーニング]]
- [[id:20240207T014102][KDOC 76: コンテナでLocaleを設定する]]。で調べたときに出てきた
