20240207T201038--kdoc-79-localeの標準的な紙のサイズとは__code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 79: Localeの標準的な紙のサイズとは</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 79: Localeの標準的な紙のサイズとは</h1>

<div id="outline-container-org473b8d6" class="outline-2">
<h2 id="org473b8d6"><a href="#org473b8d6">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org473b8d6">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-07 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb9c0259" class="outline-2">
<h2 id="orgb9c0259"><a href="#orgb9c0259">概要</a></h2>
<div class="outline-text-2" id="text-orgb9c0259">
<p>
Localeで紙のサイズの項目がある。謎に細かいけど、紙のサイズも国や地域によって異なる単位なことを初めて認識した。
</p>
</div>
</div>
<div id="outline-container-orga49f7fa" class="outline-2">
<h2 id="orga49f7fa"><a href="#orga49f7fa">値を調べる</a></h2>
<div class="outline-text-2" id="text-orga49f7fa">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>現在のlocale表示。LC_PAPERがある</label><pre class="src src-shell">locale
</pre>
</div>

<pre class="example">
LANG=en_US.UTF-8
LANGUAGE=en_US
LC_CTYPE="en_US.UTF-8"
LC_NUMERIC=ja_JP.UTF-8
LC_TIME="en_US.UTF-8"
LC_COLLATE="en_US.UTF-8"
LC_MONETARY=ja_JP.UTF-8
LC_MESSAGES="en_US.UTF-8"
LC_PAPER=ja_JP.UTF-8
LC_NAME=ja_JP.UTF-8
LC_ADDRESS=ja_JP.UTF-8
LC_TELEPHONE=ja_JP.UTF-8
LC_MEASUREMENT=ja_JP.UTF-8
LC_IDENTIFICATION=ja_JP.UTF-8
LC_ALL=
</pre>

<p>
セットされている値を調べる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>値を調べる</label><pre class="src src-shell">locale -k LC_PAPER
</pre>
</div>

<pre class="example">
height=297
width=210
paper-codeset="UTF-8"
</pre>

<p>
210mm x 297mm はA4であるので、日本の標準的な紙サイズはA4になっていることになる。そういう感じはする。
</p>
</div>
</div>
<div id="outline-container-org09539ae" class="outline-2">
<h2 id="org09539ae"><a href="#org09539ae">関連</a></h2>
<div class="outline-text-2" id="text-org09539ae">
<ul class="org-ul">
<li><a href="https://www.school.ctc-g.co.jp/columns/miyazaki/miyazaki11.html">コラム - WSLで始めるUbuntu | 第11回　ロケールとプロンプト変数について知ろう｜CTC教育サービス 研修/トレーニング</a></li>
<li><a href="20240207T014102--kdoc-76-コンテナでlocaleを設定する__code.html#ID-20240207T014102">KDOC 76: コンテナでLocaleを設定する</a>。で調べたときに出てきた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
